In [4]:
"mongodb+srv://debasish:debasish@cluster0.vom4ttt.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0"

'mongodb+srv://debasish:debasish@cluster0.vom4ttt.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0'

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/entbappy/US-Visa-Approval-Prediction/main/notebook/Visadataset.csv")
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [8]:
data = df.to_dict(orient='records')

In [9]:
type(data)

list

In [10]:
DB_NAME = 'US_VISA'
COLLECTION_NAME = 'visa_data'
CONNECTION_URL = "mongodb+srv://debasish:debasish@cluster0.vom4ttt.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0"

In [11]:
import pymongo

In [12]:
client = pymongo.MongoClient(CONNECTION_URL)
data_base = client[DB_NAME]
collection = data_base[COLLECTION_NAME]

In [13]:
rec = collection.insert_many(data)

In [15]:
len(data)

25480

In [ ]:
list(collection.find())

In [18]:
df1 = pd.DataFrame(list(collection.find()))
df1.head()

,_id,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,65d8baf3ca68f8c965be5e28,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,65d8baf3ca68f8c965be5e29,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,65d8baf3ca68f8c965be5e2a,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,65d8baf3ca68f8c965be5e2b,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,65d8baf3ca68f8c965be5e2c,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [19]:
df1.education_of_employee.value_counts()

education_of_employee
Bachelor's     10234
Master's        9634
High School     3420
Doctorate       2192
Name: count, dtype: int64

In [20]:
df1.continent.value_counts()

continent
Asia             16861
Europe            3732
North America     3292
South America      852
Africa             551
Oceania            192
Name: count, dtype: int64

In [23]:
list(df1.columns)

['_id',
 'case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'no_of_employees',
 'yr_of_estab',
 'region_of_employment',
 'prevailing_wage',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [29]:
for i in list(df1.columns):
    if (i =='_id'):
        continue
    print(df1[i])
    print('-'*40)

0           EZYV01
1           EZYV02
2           EZYV03
3           EZYV04
4           EZYV05
           ...
25475    EZYV25476
25476    EZYV25477
25477    EZYV25478
25478    EZYV25479
25479    EZYV25480
Name: case_id, Length: 25480, dtype: object
----------------------------------------
0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object
----------------------------------------
0        High School
1           Master's
2         Bachelor's
3         Bachelor's
4           Master's
            ...
25475     Bachelor's
25476    High School
25477       Master's
25478       Master's
25479     Bachelor's
Name: education_of_employee, Length: 25480, dtype: object
----------------------------------------
0        N
1        Y
2        N
3        N
4        Y
        ..
25475    Y
25476    Y
25477    Y
25478    Y
25479    Y
Name: has_job_experience, Length: 25480, dtype: object
----------------------------------------
0        N
1        N
2        Y
3        N
4        N
        ..
25475    Y
25476    N
25477    N
25478    Y
25479    N
Name: requires_job_training, Length: 25480, dtype: object
----------------------------------------
0        14513
1         2412
2        44444
3           98
4         1082
         ...
25475     2601
25476     3274
25477     1121
25478     1918
25479     3195
Name: no_of_employees, Length: 25480, dtype: int64
----------------------------------------
0        2007
1        2002
2        2008
3        1897
4        2005
         ...
25475    2008
25476    2006
25477    1910
25478    1887
25479    1960
Name: yr_of_estab, Length: 25480, dtype: int64
----------------------------------------
0             West
1        Northeast
2             West
3             West
4            South
           ...
25475        South
25476    Northeast
25477        South
25478         West
25479      Midwest
Name: region_of_employment, Length: 25480, dtype: object
----------------------------------------
0           592.2029
1         83425.6500
2        122996.8600
3         83434.0300
4        149907.3900
            ...
25475     77092.5700
25476    279174.7900
25477    146298.8500
25478     86154.7700
25479     70876.9100
Name: prevailing_wage, Length: 25480, dtype: float64
----------------------------------------
0        Hour
1        Year
2        Year
3        Year
4        Year
         ...
25475    Year
25476    Year
25477    Year
25478    Year
25479    Year
Name: unit_of_wage, Length: 25480, dtype: object
----------------------------------------
0        Y
1        Y
2        Y
3        Y
4        Y
        ..
25475    Y
25476    Y
25477    N
25478    Y
25479    Y
Name: full_time_position, Length: 25480, dtype: object
----------------------------------------
0           Denied
1        Certified
2           Denied
3           Denied
4        Certified
           ...
25475    Certified
25476    Certified
25477    Certified
25478    Certified
25479    Certified
Name: case_status, Length: 25480, dtype: object
----------------------------------------